# SetCLDrpShadowData

## Description
```pascal
PROCEDURE SetCLDrpShadowData(
				className   : STRING;
				nUnits      : INTEGER;
				dOffset     : REAL;
				dBlurRadius : REAL;
				dAngle      : REAL;
				nOpacity    : INTEGER;
				color       : LONGINT);
```

```python

def vs.SetCLDrpShadowData(className, nUnits, dOffset, dBlurRadius, dAngle, nOpacity, color):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|className|STRING||
|nUnits|INTEGER||
|dOffset|REAL||
|dBlurRadius|REAL||
|dAngle|REAL||
|nOpacity|INTEGER||
|color|LONGINT||

## Version
Availability: from Vectorworks 2017
## Category
* Classes